import random
answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да',
           'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
           'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет',
           'Перспективы не очень хорошие', 'Весьма сомнительно']
while True:
    question = input('Введите ваш вопрос и магический код поможет получить на него ответ: ')
    print(random.choice(answers))
    print()
    next_game = input('Хотите попробовать еще раз? Введите "да" или "нет": ')
    if next_game == 'да':
        continue
    elif next_game == 'нет':
        print('Что ж, надеюсь, вы сделаете правильный выбор')
        break
    else:
        print('Введите "да" или "нет".')